import 'package:flutter/cupertino.dart';
import 'package:new_moon_app/model/fasoul.dart';

final Fasoul_data = [
  Myfasoul('أولًا - فصل الشتاء: ٩١ يومًا', '١٩ ديسمبر',
      'assets/images/sitaa.jpeg', 7, 2, 91, 'الشتاء'),
  Myfasoul('ثانيًا - فصل الربيع: ٩٢ يومًا', '١٩ مارس',
      'assets/images/rabie.jpeg', 7, 4, 92, 'الربيع'),
  Myfasoul('ثالثًا - فصل الصيف: ٩٢ يومًا', ' ١٩ يونيو',
      'assets/images/summer_6.jpg', 7, 1, 92, 'الصيف'),
  Myfasoul('رابعًا - فصل الخريف: ٩١ يومًا', '١٩ سبتمبر',
      'assets/images/kraif.jpg', 7, 3, 91, 'الخريف'),
];
final fasoul_desc = [
  Myfasouldsec(
      'بداية فصل الشتاء فلكيًا:ق حينما تتعامد الشمس على مدار الجدي في ١٩ ديسمبر - كانون أول  •- فترة الانقلاب الشتوي : ثلاثة أسابيع تقريبًا من أول ديسمبر • جويريد : ثلاثة عشر يومًا "٧ - ١٨" ديسمبر قران ثالث عشر: ٨ ديسمبر وهوبداية فصل الشتاء بالعرف وبشكل عام أول الشهر سابع مجيع شابع •المربعانية: تبدأ مربعانية الشتاء بالحساب العرفي التقريبي، من ٧ ديسمبر  إلى ١٤ يناير، مدتها: ٣٩ يومًا،  وهي ثلاثة نجوم: ١-الإكليل ٢-القلب ٣-الشولة وفي الحساب الفلكي ٤٠ يومًا من ١٩ديسمبر إلى نهاية ٢٧ يناير نجوم الشتاء بشكل عام: ١- الإكليل: ٧ - ١٩ ديسمبر ٢- القلب: ٢٠ ديسمبر - ١ يناير ٣- الشولة: ٢ - ١٤ يناير ٤- النعايم: ١٥ - ٢٧ يناير ٥- البلدة: ٢٨ يناير - ٩ فبراير العقارب ، اثنتان منها في فصل الشتاء : ٦- سعد الذابح: ١٠ - ٢٢ فبراير ٧- سعد بلع: ٢٣ فبراير - ٧ مارسوالثالثة، سعد السعود، في بداية فصل الربيع من ٨ مارس',
      2),
  Myfasouldsec(
      'بداية فصل الربيع فلكيًا: حينما تتعامد الشمس على خط الإستواء في ١٩ مارس - آذا  -فترة الانقلاب الربيع: ثلاثة أسابيع تقريبا من أول مارس •موسم السماك ، ٥٢ يوما من أول مارس - آذار وبداية مارس هو قران سابع مجيع وسابع، وفي الثلث الأخير تقريبا هو قران خامس بالربيع غامس',
      4),
  Myfasouldsec(
      'حين تتعامد الشمس على مدار السرطان ١٩ يونيو -أول ثلاثة أسابيع منه تسمى فترة الانقلاب الصيفي : -مربعانية القيظ : أربعون يومًا، ١٩ يونيو - نهاية ٢٨ يوليوقران القيظ:  قران ٢٥ حزيران',
      1),
  Myfasouldsec(
      'حين تتعامد الشمس على مدار السرطان ١٩ يونيو -أول ثلاثة أسابيع منه تسمى فترة الانقلاب الصيفي : -مربعانية القيظ : أربعون يومًا، ١٩ يونيو - نهاية ٢٨ يوليوقران القيظ:  قران ٢٥ حزيران',
      1),
  Myfasouldsec(
      'الفترة الأول: بداية نجم الجبهة، الثاني من نجوم سهيل ، والأول من نجوم الخريف قران دخول الخريف قران ١٩ ب١٩ سبتمبر - أيلول الاعتدال الخريفي : ٩١ يومًا بدايته فلكيًا ١٩سبتمبر - ١٨ ديسمبر حينما تتعامد الشمس على خط الإستواء في ١٩ سبتمبر - أيلول',
      3)
];
